import React from "react";

export const PrivacyComponent = () => {
  return (
    <ul className="bg-white p-3 rounded flex flex-col gap-4 text-[#1B1B1B] font-normal text-base list-outside list-disc pl-5">
      <h1 className="text-xl font-semibold">Политика конфиденциальности</h1>
      <p>
        Мы можем получать персональные данные о вас из различных источников,
        включая этот и другие наши веб-сайты, мобильные приложения, когда вы
        звоните или пишете нам по электронной почте или общаетесь с нами через
        социальные сети, или когда вы участвуете в мероприятиях или других
        акциях. Мы также можем получать данные о вас от наших деловых партнеров
        и других третьих лиц. Любые персональные данные, которые вы нам
        предоставляете, хранятся на защищенных серверах и в наших внутренних
        системах.
      </p>
      <p>
        Наша главная цель при сборе личной информации — предоставить вам,
        пользователю, персонализированный опыт на наших сайтах. Это включает в
        себя персонализацию услуг, интерактивные коммуникации, онлайн-покупки и
        многие другие виды услуг, все из которых для вас совершенно бесплатны.
      </p>
      <p>Типы персональной информации, которую мы можем получить, включают:</p>
      <li className="ml-4">
        Ваша контактная информация (например, имя, ник в Twitter, почтовый и
        адрес электронной почты или номер телефона);
      </li>
      <li className="ml-4">
        Имя пользователя и пароль для учетной записи, которую вы можете создать
        на наших сайтах;
      </li>
      <li className="ml-4">
        Платежные реквизиты (включая номер платежной карты, код безопасности,
        дату истечения срока действия, имя владельца карты и адрес выставления
        счета);
      </li>
      <li className="ml-4">
        Информация о доставке (включая адрес доставки и номер телефона);
      </li>
      <li className="ml-4">
        Демографическая информация (например, возраст, дата рождения и пол);
      </li>
      <li className="ml-4">
        Любой контент (например, комментарии, фотографии, информация и другие
        материалы), который вы публикуете непосредственно на наших сайтах
        (пожалуйста, имейте в виду, что любая предоставленная вами личная
        информация может быть прочитана, собрана или использована другими
        лицами; соответственно, пожалуйста, проявляйте осторожность, принимая
        решение о раскрытии любой личной информации в публичных мероприятиях или
        сообщениях);
      </li>
      <li className="ml-4">
        Информация, которую вы предоставляете, взаимодействуя с нами через
        социальные сети, включая фотографии;
      </li>
      <li className="ml-4">
        Информация о местоположении, например, географическое местоположение в
        реальном времени устройства, на которое вы устанавливаете наши мобильные
        приложения (примечание: когда вы используете одно из наших приложений на
        своем мобильном устройстве, вы можете отказаться от предоставления нам
        данных о своем местоположении, изменив настройки служб определения
        местоположения устройства. Для получения инструкций по изменению
        соответствующих настроек обратитесь к своему поставщику услуг или
        производителю устройства);
      </li>
      <li className="ml-4">
        Поведение и предпочтения при чтении, просмотре и покупках, а также
        запись покупок, которые вы совершаете на наших веб-сайтах;
      </li>
      <li className="ml-4">
        Ваши поисковые запросы, выполненные на наших сайтах; и
      </li>
      <li className="ml-4">
        Другие сведения, которые вы можете предоставить нам или которые могут
        быть включены в информацию, предоставленную нам третьими лицами.
      </li>

      <p>
        Кроме того, мы можем использовать «cookie», «идентификаторы устройств»
        или аналогичные типы технологий (например, пиксельные теги, веб-маяки,
        прозрачные GIF-файлы и локальное хранилище) для сбора информации о вашем
        использовании наших сайтов. Мы можем использовать эту информацию, чтобы
        повысить эффективность и полезность наших сайтов, настроить ваше
        посещение наших сайтов и в других целях, чтобы сделать ваше посещение
        более удобным или чтобы мы могли улучшить наши услуги. Для вашего
        сведения, «cookie» — это файлы, которые веб-сайт хранит на жестком диске
        вашего компьютера, а «идентификаторы устройств» — это файлы, которые
        хранятся на вашем мобильном устройстве и идентифицируют ваше устройство.
        Кроме того, мы можем использовать третьих лиц для предоставления вам
        продуктов и услуг через наши сайты. Эти третьи лица могут использовать
        куки, идентификаторы устройств или аналогичные технологии. Примечание:
        большинство браузеров сообщат вам, как прекратить прием новых куки, как
        получать уведомления о получении нового куки и как отключить
        существующие куки. Однако обратите внимание, что без куки вы не сможете
        в полной мере воспользоваться всеми функциями наших сайтов. Кроме того,
        отключение файлов cookie может отменить отказы, которые полагаются на
        файлы cookie, такие как отказы от целевой рекламы. Наконец, ваше
        мобильное устройство может предоставить вам информацию и выбор
        относительно того, какие данные будут предоставлены нам.
      </p>
    </ul>
  );
};