import React from "react";

const TermsComponent: React.FC = () => {
  return (
    <ul className="bg-white p-3 rounded flex flex-col gap-4 text-[#1B1B1B] font-normal text-base list-outside list-disc pl-5">
      <h1 className="text-xl font-semibold">Срок и условие</h1>
      <p>
        Мы можем время от времени изменять условия настоящего Пользовательского
        соглашения: Мы оставляем за собой право изменять условия настоящего
        Пользовательского соглашения или изменять любые функции нашего Сервиса в
        любое время без предварительного уведомления вас, и, продолжая
        использовать наш Сервис, вы соглашаетесь соблюдать такие изменения. Любые
        изменения настоящего Пользовательского соглашения становятся частью
        настоящего Пользовательского соглашения и вступают в силу с момента их
        публикации. Самую последнюю версию Пользовательского соглашения можно
        просмотреть в любое время по адресу: kasual.id. Если явно не указано иное,
        любые новые функции или возможности, которые дополняют или улучшают наш
        Сервис, регулируются настоящим Пользовательским соглашением.
      </p>
      <p>
        Мы можем прекратить предоставление Услуги или ваше использование Услуги: Мы
        оставляем за собой право в любое время и время от времени изменять или
        прекращать, временно или навсегда, нашу Услугу (или любую ее часть) с
        уведомлением или без него. Вы соглашаетесь с тем, что мы не будем нести
        ответственности перед вами или любой третьей стороной за любые изменения,
        приостановку или прекращение нашей Услуги. Кроме того, мы можем по нашему
        собственному усмотрению прекратить или приостановить ваш доступ и
        использование нашей Услуги (или любой ее части) в любое время по любой
        причине (включая, помимо прочего, если мы считаем, что вы нарушили или
        действовали не в соответствии с условиями следующего параграфа) или без
        какой-либо причины.
      </p>
      <p>
        При использовании нашего Сервиса вы соглашаетесь соблюдать определенные
        основные правила: в той мере, в которой это требуется, вы соглашаетесь
        предоставлять правдивую, точную, актуальную и полную информацию о себе, как
        запрашивается любой формой подписки и/или любой формой регистрации. Если
        какая-либо предоставленная вами информация является ложной, неточной,
        неактуальной или неполной, мы оставляем за собой право прекратить вашу
        подписку и отказать в любом текущем или будущем использовании нашего
        Сервиса по нашему собственному усмотрению. Когда вы регистрируетесь у нас,
        вы принимаете на себя ответственность за все действия, которые происходят
        под вашей учетной записью или паролем, и вы соглашаетесь, что не будете
        продавать, передавать или уступать свое членство или любые права членства.
        В рамках вашей подписки вы соглашаетесь не использовать наш Сервис для:
      </p>
      <li className="ml-4">
        Загружать, размещать, публиковать, отправлять по электронной почте,
        воспроизводить, распространять или иным образом передавать любую
        информацию, данные, текст, музыку, звук, фотографии, графику, видео,
        сообщения или другие материалы, которые являются незаконными, вредными,
        угрожающими, смущающими, оскорбительными, преследующими, деликтными,
        клеветническими, вульгарными, непристойными, клеветническими,
        обманчивыми, мошенническими, содержат явные или графические описания или
        отчеты о сексуальных действиях, нарушают чужую конфиденциальность или
        вызывают ненависть; «преследовать» другого;
      </li>
      <li className="ml-4">
        Загружать, размещать, публиковать, отправлять по электронной почте,
        воспроизводить, распространять или иным образом передавать любой контент,
        который преследует, преследует, унижает или запугивает человека или группу
        людей по признаку религии, пола, сексуальной ориентации, расы,
        этнической принадлежности, возраста или инвалидности;
      </li>
      <li className="ml-4">Наносить вред несовершеннолетним каким-либо образом;</li>
      <li className="ml-4">
        Выдавать себя за любое лицо или организацию, включая, помимо прочего,
        должностное лицо или другого сотрудника KASUAL, или ложно заявлять или
        иным образом искажать свою принадлежность к лицу или организации;
      </li>
      <li className="ml-4">
        Подделывать заголовки или иным образом манипулировать идентификаторами,
        чтобы скрыть происхождение любого контента, передаваемого на или через наш
        Сервис;
      </li>
      <li className="ml-4">
        Загружать, размещать, публиковать, отправлять по электронной почте,
        воспроизводить, распространять или иным образом передавать любую
        незапрошенную или несанкционированную рекламу, рекламные материалы,
        «нежелательную почту», «спам», «цепочные письма», «финансовые пирамиды» или
        любую другую форму навязывания услуг;
      </li>
      <li className="ml-4">
        Загружать, размещать, публиковать, отправлять по электронной почте,
        воспроизводить, распространять или иным образом передавать любой материал,
        содержащий программные вирусы, троянских коней, червей, бомбы замедленного
        действия, Cancelbots или любой другой компьютерный код, файлы или
        программы, предназначенные для прерывания, уничтожения или ограничения
        функциональности любого компьютерного программного обеспечения или
        оборудования или телекоммуникационного оборудования или любой другой
        аналогичной разрушительной деятельности или тайно перехватывать или
        экспроприировать любую систему, данные или личную информацию; Действовать
        таким образом, который негативно влияет на способность других пользователей
        использовать наш Сервис;
      </li>
      <li className="ml-4">
        Вмешиваться или нарушать работу нашего Сервиса или серверов или сетей,
        подключенных к нашему Сервису, или не соблюдать какие-либо требования,
        процедуры, политики или правила сетей, подключенных к нашему Сервису; или
      </li>
      <li className="ml-4">
        Намеренно или ненамеренно нарушать любые применимые местные, государственные,
        национальные или международные законы.
      </li>
    </ul>
  );
};

export default TermsComponent;
